#include <cmath>
#include "xak.h"

double XAK::temp(double v) {
    if (v >= -5.891 && v < 0) {
        double C[9] = {0, 2.5173462e1, -1.1662878, -1.0833638,
                       -8.9773540e-1, -3.7342377e-1, -8.6632643e-2,
                       -1.0450598e-2, -5.1920577e-4};
        return calculate(C, 9, v);
    } else if (v >= 0 && v < 20.644) {
        double C[10] = {0, 2.508355e1, 7.860106e-2, -2.503131e-1,
                        8.315270e-2, -1.228034e-2, 9.804036e-4,
                        -4.413030e-5, 1.057734e-6, -1.052755e-8};
        return calculate(C, 10, v);
    } else if (v >= 20.644 && v <= 54.886) {
        double C[7] = {-1.318058e2, 4.830222e1, -1.646031,
                       5.464731e-2, -9.650715e-4, 8.802193e-6,
                       -3.110810e-8};
        return calculate(C, 7, v);
    } else
        throw "value is out of bounds [-5.891..54.886]";
}

double XAK::value(double temp) {
    if (temp >= -270 && temp < 0) {
        double A[11] = {0, 3.9450128025e-2, 2.3622373598e-5, -3.2858906784e-7,
                        -4.9904828777e-9, -6.7509059173e-11, -5.7410327428e-13,
                        -3.1088872894e-15, -1.0451609365e-17, -1.9889266878e-20,
                        -1.6322697486e-23};
        return calculate(A, 11, temp);
    } else if (temp >= 0 && temp <= 1372) {
        double A[10] = {-1.7600413686e-2, 3.8921204975e-2, 1.8558770032e-5,
                        -9.9457592874e-8, 3.1840945719e-10, -5.6072844889e-13,
                        5.6075059059e-16, -3.2020720003e-19, 9.7151147152e-23,
                        -1.2104721275e-26};
        double start = 1.185976e-1 * exp(-1.183432e-4 * (temp - 126.9686) * (temp - 126.9686));
        return calculate(A, 10, temp, start);
    } else
        throw "temp is out of bounds [-270..1372]";
}

const char *XAK::name() {
    return "ТХА(K)";
}

const char *XAK::description() {
    return "Номинальная статическая характеристика "
            "преобразования термопары типа ТХА(K) "
            "{ никель-хром/никель-алюминий (хромель/алюмель) }";
}
